#### RDBMS- MySQL

## Necessary Modules

In [ ]:
#(** To avoid error ,first uninstall the modules if exists from before. Then install again.)
#pip3 install mysql-connector-python
# pip3 install mysqlclient
# pip3 install ipython-sql
# pip3 install mypy-extensions
# pip3 install SQLAlchemy
# pip3 install PyMySQL

## Creating a database and connecting to it

In [1]:
#Connecting to MySQL database
import mysql.connector as sql
mydb=sql.connect(host="localhost",user="root",passwd="Mahmud")
mycursor = mydb.cursor()

In [ ]:
#Creating a database
mycursor.execute("CREATE DATABASE Problem_set_03")

In [ ]:
#Deleting the database
#mycursor.execute("DROP DATABASE Problem_set_03")

In [2]:
%load_ext sql

In [3]:
#Connecting to the database which was created before
%sql mysql://root:Mahmud@localhost/Problem_set_03

## Schema

![Cat](dataset/schema.png)

## Creating necessary table

In [ ]:
%%sql
create table STATION(
    ID INTEGER,
    CITY VARCHAR(50),
    STATE VARCHAR(3),
    LAT_N DECIMAL(21,10),
    LONG_W DECIMAL(21,10));

In [ ]:
%%sql
desc STATION

In [ ]:
# %%sql
# drop table STATION;

## Loading data to the table

In [ ]:
%%sql
load data infile "C:/ProgramData/MySQL/MySQL Server 8.0/Uploads/Problem_set_03.csv"
  into table STATION
    fields terminated by ","
      enclosed by '"'
        lines terminated by '\n'
          ignore 1 rows;

In [4]:
%%sql
select * from STATION limit 5;

 * mysql://root:***@localhost/Problem_set_03
5 rows affected.

[(1, 'Pfeifer', 'KS', Decimal('37.4447804700'), Decimal('65.6849125200')),
 (3, 'Hesperia', 'CA', Decimal('106.0569286000'), Decimal('71.1187671100')),
 (4, 'South Britain', 'CT', Decimal('65.5842193100'), Decimal('33.6050437900')),
 (11, 'Crescent City', 'FL', Decimal('58.0396424800'), Decimal('117.9040740000')),
 (14, 'Forest', 'MS', Decimal('120.2830760000'), Decimal('50.2288335600'))]

### Problem 1: Query the following two values from the STATION table:
#### o	The sum of all values in LAT_N rounded to a scale of 2  decimal places.

#### o	The sum of all values in LONG_W rounded to a scale of 2  decimal places.

In [5]:
%%sql
select round(sum(LAT_N),2) as lat,round(sum(LONG_W),2) as lon from STATION;

 * mysql://root:***@localhost/Problem_set_03
1 rows affected.

[(Decimal('42850.04'), Decimal('47381.48'))]

### Problem 2: Query the sum of Northern Latitudes (LAT_N) from STATION having values greater than 38.7880 and less than 137.2345. Truncate your answer to 4 decimal places.

In [6]:
%%sql
select round(sum(LAT_N),4) as SUM from STATION
  where LAT_N>38.7880 and LAT_N<137.2345

 * mysql://root:***@localhost/Problem_set_03
1 rows affected.

[(Decimal('36354.8135'),)]

### Problem 3:	Query the greatest value of the Northern Latitudes (LAT_N) from STATION that is less than 137.2345. Truncate your answer to 4 decimal places.

In [7]:
%%sql
select round(max(LAT_N),4) as "Greatest value" from STATION
  where LAT_N<137.2345

 * mysql://root:***@localhost/Problem_set_03
1 rows affected.

[(Decimal('137.0193'),)]

### Problem 4: Query the Western Longitude (LONG_W) for the largest Northern Latitude (LAT_N) in STATION that is less than 137.2345 . Round your answer to 4 decimal places.

In [8]:
%%sql
select round(LONG_W,4) as "Greatest value" from STATION 
  where LAT_N=(select max(LAT_N) from STATION
                where LAT_N<137.2345)

 * mysql://root:***@localhost/Problem_set_03
1 rows affected.

[(Decimal('117.2465'),)]

### Problem 5:  Query the smallest Northern Latitude (LAT_N) from STATION that is greater than 38.7880  . Round your answer to 4 decimal places.

In [9]:
%%sql
select round(min(LAT_N),4) as "Smallest value" from STATION
  where LAT_N>38.7880

 * mysql://root:***@localhost/Problem_set_03
1 rows affected.

[(Decimal('38.8526'),)]

### Problem 6:	Query the Western Longitude (LONG_W) where the smallest Northern Latitude (LAT_N) in STATION is greater than 38.7880  . Round your answer to 4 decimal places.

In [10]:
%%sql
select round(LONG_W,4) as "Smallest value" from STATION 
  where LAT_N=(select min(LAT_N) from STATION
                where LAT_N>38.7880)

 * mysql://root:***@localhost/Problem_set_03
1 rows affected.

[(Decimal('70.1378'),)]

### Problem 7: Consider  P1(a,b)  and P2(c,d) to be two points on a 2D plane.
#### •	a  happens to equal the minimum value in Northern Latitude (LAT_N in STATION).

#### •	 b happens to equal the minimum value in Western Longitude (LONG_W in STATION).

#### •	 c happens to equal the maximum value in Northern Latitude (LAT_N in STATION).

#### •	 d happens to equal the maximum value in Western Longitude (LONG_W in STATION).
### Query the Manhattan Distance between points P1 and P2 and round it to a scale of 4 decimal places.

In [11]:
%%sql
select round(abs(min(LAT_N)-max(LAT_N))+abs(min(LONG_W)-max(LONG_W)),4) as "Manhatten Distance"
  from STATION

 * mysql://root:***@localhost/Problem_set_03
1 rows affected.

[(Decimal('259.6859'),)]

### Problem 8:	Consider  P1(a,c)  and P2(b,d)   to be two points on a 2D plane where (a,b)  are the respective minimum and maximum values of Northern Latitude (LAT_N) and (c,d)  are the respective minimum and maximum values of Western Longitude (LONG_W) in STATION.

### Query the Euclidean Distance between points P1 and P2 and format your answer to display 4 decimal digits

In [12]:
%%sql
select round(sqrt(pow(min(LAT_N)-max(LAT_N),2)+
                  pow(min(LONG_W)-max(LONG_W),2)),4) as "Euclidean Distance"
  from STATION

 * mysql://root:***@localhost/Problem_set_03
1 rows affected.

[(184.1616,)]